<template>
    <div class="grid gap-16">
        <h3>Посилання:</h3>
        <div class="mb-16">
            <p>
                Переглянути проєкт на сайті:
                <a href="//labs.system-25.com" target="_blank">
                    labs.system-25.com
                </a>
            </p>
            <p>
                Переглянути проєкт на
                <a
                    href="https://github.com/alexdev5/zpi-zp41_appWeb-KarakaiOleksandr-2025"
                    target="_blank"
                >
                    github
                </a>
            </p>
        </div>

        <h3>Тема проєкту</h3>
        <section>
            <p class="font-size-m">
                SPA-додаток для перегляду лабораторних робіт студента
            </p>
        </section>

        <h3>Мета проєкту</h3>
        <section>
            <p class="font-size-m">
                Забезпечити зручний спосіб перегляду лабораторних робіт як для
                студента, так і для викладача. Упорядкувати їх за темами та
                надати можливість легкого доступу до всіх частин роботи.
            </p>
        </section>

        <h3>Функціональні вимоги</h3>
        <section>
            <ul class="list">
                <li>
                    Інтерфейс повинен забезпечувати:
                    <ul class="list">
                        <li>Легку навігацію між лабораторними роботами.</li>
                        <li>
                            Відображення кожної роботи у вигляді вкладок із
                            структурованим поділом інформації.
                        </li>
                    </ul>
                </li>
                <li>
                    Кожна вкладка повинна коректно відображати вміст: текстову
                    інформацію, HTML-код, таблиці, зображення тощо.
                </li>
                <li>
                    Додаток повинен працювати без авторизації чи реєстрації.
                </li>
            </ul>
        </section>

        <h3 class="block-title">Функціонал</h3>

        <section>
            <ul class="list">
                <li>Відображення списку лабораторних робіт.</li>
                <li>
                    Перехід до конкретної лабораторної роботи для перегляду.
                </li>
                <li>
                    Простий перехід між вкладками для швидкого доступу до
                    потрібної частини лабораторної роботи.
                </li>
                <li>
                    Можливість переглянути HTML код у вікні перегляду
                    лабораторної роботи
                </li>
            </ul>
        </section>

        <h3 class="block-title">Сценарій використання додатку</h3>
        <ul class="list">
            <li>Користувач відкриває додаток у веб-браузері.</li>
            <li>
                На головній сторінці відображається список доступних
                лабораторних робіт та опис додатку
            </li>
            <li>
                Користувач натискає на потрібну лабораторну роботу зі списку
            </li>
            <li>Додаток відкриває відповідну сторінку лабораторної роботи</li>
            <li>
                Для кожної роботи відображається інтерфейс із вкладками,
                наприклад:
                <ul class="list">
                    <li>
                        "Тема, мета, місце розташування" – загальна інформація
                        про роботу
                    </li>
                    <li>
                        "Опис предметного середовища" – опис галузі й
                        функціоналу роботи.
                    </li>
                    <li>
                        "Структура документа" – структура документа роботи у
                        форматі тексту.
                    </li>
                    <li>
                        "HTML-код таблиць, форм, зображень" – відповідні
                        HTML-фрагменти коду.
                    </li>
                    <li>
                        Користувач може перемикатися між вкладками для перегляду
                        необхідної інформац
                    </li>
                </ul>
            </li>
        </ul>
    </div>
</template>

<script lang="ts" setup></script>

<style lang="scss"></style>
