<template>
    <h3>Висновки:</h3>
    <div>
        <p>
            У ході виконання лабораторної роботи були реалізовані наступні
            етапи:
        </p>
        <ol>
            <li>
                <p><strong>Налаштування середовища розробки</strong>:</p>
                <ul>
                    <li>
                        Виконано всі необхідні налаштування для роботи з GitHub.
                    </li>
                    <li>Створено веб-сайт для проекту.</li>
                </ul>
            </li>
            <li>Створення HTML-документа</li>
            <li>Робота з теорією HTML</li>
            <li>
                Створено таблицю, списки та зображення відповідно до завдання.
            </li>
            <li>
                Підготовлено код для кожного елемента сторінки з чітким
                форматуванням і коментарями.
            </li>

            <li>
                Усі елементи (таблиця, зображення, списки) представлені як у
                вигляді коду, так і у вигляді скріншотів із поясненнями.
            </li>
        </ol>
    </div>
</template>

<script lang="ts" setup></script>

<style lang="scss"></style>
