<template>
    <div class="grid gap-8">
        <p class="flex gap-8">
            <b>Тема:</b>СТРУКТУРА HTML-ДОКУМЕНТА. ВИБІР ПРЕДМЕТНОЇ ГАЛУЗІ.
            РОБОТА З ПОСИЛАННЯМИ, ТАБЛИЦЯМИ, ЗОБРАЖЕННЯМИ, СПИСКАМИ в
            HTML-ДОКУМЕНТІ.
        </p>
        <p class="flex gap-8">
            <b>Мета:</b>Придбати практичні навички роботи з HTML-документом,
            таблицями, зображеннями, посиланнями, списками, формами.<br />
            Створити шаблон звітного HTML-документом для відображення
            результатів роботи всіх лабораторних робіт.
        </p>
    </div>
</template>

<script lang="ts" setup></script>

<style lang="scss">
.flex-container {
}
</style>
