<template>
    <div class="grid gap-16">
        <div class="grid gap-8">
            <p>
                Напиши скрипт створення й очищення колекції елементів з
                наступним функціоналом. Є input, у який користувач вводить
                бажану кількість елементів. Після натискання на
                кнопку Create має рендеритися (додаватися в DOM) колекція з
                відповідною кількістю елементів і очищатися значення в інпуті.
                При повторному натисканні на кнопку Create поверх старої
                колекції має рендеритись нова. Після натискання на
                кнопку Destroy колекція елементів має очищатися. <br />
                Після натискання користувачем на кнопку Create треба
                провалідувати значення в input, воно має бути в межах від 1 до
                100 включно. Тільки якщо воно задоволяє умову, мають додаватися
                нові &lt;div&gt; елементи в DOM. Для рендеру елементів на
                сторінці створи функцію createBoxes(amount), яка приймає один
                параметр — число, що зберігає кількість елементів для рендеру.
                Функція має створювати стільки &lt;div&gt; елементів, скільки
                вказано в параметрі amount і додавати їх у DOM дочірніми
                елементами для div#boxes. <br />
                1. Розміри першого &lt;div&gt; елемента мають бути 30px на 30px.
                <br />
                2. Кожен наступний елемент повинен бути ширшим і вищим від
                попереднього на 10px. <br />
                3. Усі елементи повинні мати випадковий колір фону. Використовуй
                готову функцію getRandomHexColor() для отримання випадкового
                кольору. <br />
                <br />
                Для очищення колекції після натискання на кнопку Destroy створи
                функцію destroyBoxes(), яка очищає вміст div#boxes, у такий
                спосіб видаляючи всі створені елементи.
            </p>
            <div class="flex gap-16">
                <code class="code-block">
                    <pre></pre>
                </code>
            </div>
        </div>
    </div>
</template>

<script lang="ts" setup></script>
<style>
.code-block {
    ul {
        padding-inline: 16px;

        li {
            display: grid;
            grid-template-columns: 120px 1fr;
        }
    }
}
</style>
